{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "BuildPatchInstaller",
			"Children": [
				{
					"Source":
					{
						"Text": "Please Wait"
					},
					"Translation":
					{
						"Text": "Aguarde"
					},
					"Key": "BuildPatchInstaller_GenericProgress"
				},
				{
					"Source":
					{
						"Text": "{Current} / {Total} ({Speed}/sec)"
					},
					"Translation":
					{
						"Text": "{Current}/{Total} ({Speed}/s)"
					},
					"Key": "BuildPatchInstaller_DownloadSpeedFormat"
				}
			]
		},
		{
			"Namespace": "BuildPatchInstallError",
			"Children": [
				{
					"Source":
					{
						"Text": "A file access error has occurred. Please check your running processes."
					},
					"Translation":
					{
						"Text": "Ocorreu um erro ao acessar um arquivo. Verifique seus processos ativos."
					},
					"Key": "BuildPatchInstallShortError_MoveFileToInstall"
				},
				{
					"Source":
					{
						"Text": "A file corruption has occurred. Please try again."
					},
					"Translation":
					{
						"Text": "Um arquivo foi corrompido. Tente novamente."
					},
					"Key": "BuildPatchInstallShortError_FileConstructionFail"
				},
				{
					"Source":
					{
						"Text": "An unknown error ocurred. Please contact support."
					},
					"Translation":
					{
						"Text": "Ocorreu um erro desconhecido. Entre em contato com o suporte."
					},
					"Key": "BuildPatchInstallShortError_InvalidOrMax"
				},
				{
					"Source":
					{
						"Text": "Could not download patch data. Please check your internet connection, and try again."
					},
					"Translation":
					{
						"Text": "Não foi possível baixar os arquivos do patch. Verifique sua conexão com a internet e tente novamente."
					},
					"Key": "BuildPatchInstallShortError_DownloadError"
				},
				{
					"Source":
					{
						"Text": "Maximum path length exceeded. Please specify a shorter install location."
					},
					"Translation":
					{
						"Text": "Tamanho máximo do caminho excedido. Especifique um local de instalação mais curto."
					},
					"Key": "BuildPatchInstallShortError_PathLengthExceeded"
				},
				{
					"Source":
					{
						"Text": "Not enough disk space available. Please free up some disk space and try again."
					},
					"Translation":
					{
						"Text": "Espaço insuficiente no disco. Libere espaço no disco e tente novamente."
					},
					"Key": "BuildPatchInstallShortError_OutOfDiskSpace"
				},
				{
					"Source":
					{
						"Text": "Patching service could not start. Please contact support."
					},
					"Translation":
					{
						"Text": "Não foi possível iniciar o serviço de aplicação do patch. Entre em contato com o suporte."
					},
					"Key": "BuildPatchInstallShortError_ApplicationError"
				},
				{
					"Source":
					{
						"Text": "The application is closing."
					},
					"Translation":
					{
						"Text": "O aplicativo está sendo fechado."
					},
					"Key": "BuildPatchInstallShortError_ApplicationClosing"
				},
				{
					"Source":
					{
						"Text": "The following directory could not be created.\n{0}"
					},
					"Translation":
					{
						"Text": "Não foi possível criar o seguinte diretório.\n{0}"
					},
					"Key": "MissingStageDirectory"
				},
				{
					"Source":
					{
						"Text": "The installation directory could not be created.\n{0}"
					},
					"Translation":
					{
						"Text": "Não foi possível criar diretório de instalação.\n{0}"
					},
					"Key": "MissingInstallDirectory"
				},
				{
					"Source":
					{
						"Text": "The installation is corrupt. Please contact support."
					},
					"Translation":
					{
						"Text": "A instalação está corrompida. Entre em contato com o suporte."
					},
					"Key": "BuildPatchInstallShortError_BuildCorrupt"
				},
				{
					"Source":
					{
						"Text": "The installer failed to initialize. Please contact support."
					},
					"Translation":
					{
						"Text": "Ocorreu uma falha na inicialização do instalador. Entre em contato com o suporte."
					},
					"Key": "BuildPatchInstallShortError_InitializationError"
				},
				{
					"Source":
					{
						"Text": "The necessary prerequisites have failed to install. Please contact support."
					},
					"Translation":
					{
						"Text": "Falha ao instalar os pré-requisitos necessários. Entre em contato com o suporte."
					},
					"Key": "BuildPatchInstallShortError_PrerequisiteError"
				},
				{
					"Source":
					{
						"Text": "The operation was successful."
					},
					"Translation":
					{
						"Text": "A operação foi um sucesso."
					},
					"Key": "BuildPatchInstallShortError_NoError"
				},
				{
					"Source":
					{
						"Text": "There is not enough space at {Location}\n{RequiredBytes} is required.\n{AvailableBytes} is available.\nYou need an additional {SpaceAdditional} to perform the installation."
					},
					"Translation":
					{
						"Text": "Espaço insuficiente em {Location}\nNecessário: {RequiredBytes}.\nDisponível: {AvailableBytes}.\nVocê precisa de {SpaceAdditional} a mais para a instalação."
					},
					"Key": "InstallDirectoryDiskSpace"
				},
				{
					"Source":
					{
						"Text": "There is not enough space on your device.\n{RequiredBytes} is required.\n{AvailableBytes} is available.\nYou need an additional {SpaceAdditional} to perform the installation."
					},
					"Translation":
					{
						"Text": "Espaço insuficiente no dispositivo.\nNecessário: {RequiredBytes}.\nDisponível: {AvailableBytes}.\nVocê precisa de {SpaceAdditional} a mais para a instalação."
					},
					"Key": "InstallDirectoryDiskSpaceDevice"
				},
				{
					"Source":
					{
						"Text": "This installation could not continue due to a configuration issue. Please contact support."
					},
					"Translation":
					{
						"Text": "A instalação foi interrompida devido a um problema de configuração. Entre em contato com o suporte."
					},
					"Key": "InvalidInstallTags"
				},
				{
					"Source":
					{
						"Text": "This installation could not continue due to a prerequisite configuration issue. Please contact support."
					},
					"Translation":
					{
						"Text": "A instalação foi interrompida devido a um problema de configuração de pré-requisito. Entre em contato com o suporte."
					},
					"Key": "MissingPrereqForPrereqOnlyInstall"
				},
				{
					"Source":
					{
						"Text": "User cancelled."
					},
					"Translation":
					{
						"Text": "Cancelado pelo usuário."
					},
					"Key": "BuildPatchInstallShortError_UserCanceled"
				}
			]
		},
		{
			"Namespace": "BuildPatchInstallProgress",
			"Children": [
				{
					"Source":
					{
						"Text": "Cleaning up"
					},
					"Translation":
					{
						"Text": "Limpando"
					},
					"Key": "EBuildPatchProgress_CleanUp"
				},
				{
					"Source":
					{
						"Text": "Complete"
					},
					"Translation":
					{
						"Text": "Concluir"
					},
					"Key": "EBuildPatchProgress_Complete"
				},
				{
					"Source":
					{
						"Text": "Downloading"
					},
					"Translation":
					{
						"Text": "Baixando"
					},
					"Key": "EBuildPatchProgress_Downloading"
				},
				{
					"Source":
					{
						"Text": "Initializing"
					},
					"Translation":
					{
						"Text": "Inicializando"
					},
					"Key": "EBuildPatchProgress_Initialising"
				},
				{
					"Source":
					{
						"Text": "Installing"
					},
					"Translation":
					{
						"Text": "Instalando"
					},
					"Key": "EBuildPatchProgress_Installing"
				},
				{
					"Source":
					{
						"Text": "Paused"
					},
					"Translation":
					{
						"Text": "Pausado"
					},
					"Key": "EBuildPatchProgress_Paused"
				},
				{
					"Source":
					{
						"Text": "Prerequisites"
					},
					"Translation":
					{
						"Text": "Pré-requisitos"
					},
					"Key": "EBuildPatchProgress_PrerequisitesInstall"
				},
				{
					"Source":
					{
						"Text": "Queued"
					},
					"Translation":
					{
						"Text": "Na Fila"
					},
					"Key": "EBuildPatchProgress_Queued"
				},
				{
					"Source":
					{
						"Text": "Resuming"
					},
					"Translation":
					{
						"Text": "Retomando"
					},
					"Key": "EBuildPatchProgress_Resuming"
				},
				{
					"Source":
					{
						"Text": "Verifying"
					},
					"Translation":
					{
						"Text": "Verificando"
					},
					"Key": "EBuildPatchProgress_BuildVerification"
				}
			]
		},
		{
			"Namespace": "DynamicRHI",
			"Children": [
				{
					"Source":
					{
						"Text": "NullDrv failure?"
					},
					"Translation":
					{
						"Text": "Falha no NullDrv?"
					},
					"Key": "NullDrvFailure"
				}
			]
		},
		{
			"Namespace": "GenericPlatform",
			"Children": [
				{
					"Source":
					{
						"Text": "File Manager"
					},
					"Translation":
					{
						"Text": "Gerenciador de Arquivos"
					},
					"Key": "FileManagerName"
				}
			]
		},
		{
			"Namespace": "GpuProfiler",
			"Children": [
				{
					"Source":
					{
						"Text": "WARNING: This GPU profile was captured with v-sync enabled.  V-sync wait time may show up in any bucket, and as a result the data in this profile may be skewed. Please profile with v-sync disabled to obtain the most accurate data."
					},
					"Translation":
					{
						"Text": "AVISO: este perfil de GPU foi encontrado com o V-sync habilitado. O tempo de espera do V-sync pode aparecer em qualquer intervalo e, como resultado, os dados do perfil podem ser danificados. Desabilite o V-sync para obter dados mais precisos."
					},
					"Key": "GpuProfileVsyncEnabledWarning"
				}
			]
		},
		{
			"Namespace": "InputKeys",
			"Children": [
				{
					"Source":
					{
						"Text": "Acceleration"
					},
					"Translation":
					{
						"Text": "Aceleração"
					},
					"Key": "Acceleration"
				},
				{
					"Source":
					{
						"Text": "Ampersand"
					},
					"Translation":
					{
						"Text": "E Comercial"
					},
					"Key": "Ampersand"
				},
				{
					"Source":
					{
						"Text": "Android"
					},
					"Translation":
					{
						"Text": "Android"
					},
					"Key": "AndroidSubCateogry"
				},
				{
					"Source":
					{
						"Text": "Android Back"
					},
					"Translation":
					{
						"Text": "Android — Voltar"
					},
					"Key": "Android_Back"
				},
				{
					"Source":
					{
						"Text": "Android Menu"
					},
					"Translation":
					{
						"Text": "Android — Menu"
					},
					"Key": "Android_Menu"
				},
				{
					"Source":
					{
						"Text": "Android Volume Down"
					},
					"Translation":
					{
						"Text": "Android — Abaixar o volume"
					},
					"Key": "Android_Volume_Down"
				},
				{
					"Source":
					{
						"Text": "Android Volume Up"
					},
					"Translation":
					{
						"Text": "Android — Aumentar o volume"
					},
					"Key": "Android_Volume_Up"
				},
				{
					"Source":
					{
						"Text": "Any Key"
					},
					"Translation":
					{
						"Text": "Qualquer tecla"
					},
					"Key": "AnyKey"
				},
				{
					"Source":
					{
						"Text": "Apostrophe"
					},
					"Translation":
					{
						"Text": "Apóstrofo"
					},
					"Key": "Apostrophe"
				},
				{
					"Source":
					{
						"Text": "Asterisk"
					},
					"Translation":
					{
						"Text": "Asterisco"
					},
					"Key": "Asterix"
				},
				{
					"Source":
					{
						"Text": "Backslash"
					},
					"Translation":
					{
						"Text": "Barra Invertida"
					},
					"Key": "Backslash"
				},
				{
					"Source":
					{
						"Text": "Backspace"
					},
					"Translation":
					{
						"Text": "Backspace"
					},
					"Key": "BackSpace"
				},
				{
					"Source":
					{
						"Text": "Caps"
					},
					"Translation":
					{
						"Text": "CapsLock"
					},
					"Key": "CapsLockShort"
				},
				{
					"Source":
					{
						"Text": "Caps Lock"
					},
					"Translation":
					{
						"Text": "Caps Lock"
					},
					"Key": "CapsLock"
				},
				{
					"Source":
					{
						"Text": "Caret"
					},
					"Translation":
					{
						"Text": "Acento Circunflexo"
					},
					"Key": "Caret"
				},
				{
					"Source":
					{
						"Text": "Colon"
					},
					"Translation":
					{
						"Text": "Dois pontos"
					},
					"Key": "Colon"
				},
				{
					"Source":
					{
						"Text": "Comma"
					},
					"Translation":
					{
						"Text": "Vírgula"
					},
					"Key": "Comma"
				},
				{
					"Source":
					{
						"Text": "Del"
					},
					"Translation":
					{
						"Text": "Delete"
					},
					"Key": "DeleteShort"
				},
				{
					"Source":
					{
						"Text": "Delete"
					},
					"Translation":
					{
						"Text": "Delete"
					},
					"Key": "Delete"
				},
				{
					"Source":
					{
						"Text": "Dollar"
					},
					"Translation":
					{
						"Text": "Cifrão"
					},
					"Key": "Dollar"
				},
				{
					"Source":
					{
						"Text": "Down"
					},
					"Translation":
					{
						"Text": "Para Baixo"
					},
					"Key": "Down"
				},
				{
					"Source":
					{
						"Text": "End"
					},
					"Translation":
					{
						"Text": "End"
					},
					"Key": "End"
				},
				{
					"Source":
					{
						"Text": "Enter"
					},
					"Translation":
					{
						"Text": "Enter"
					},
					"Key": "Enter"
				},
				{
					"Source":
					{
						"Text": "Equals"
					},
					"Translation":
					{
						"Text": "Igual"
					},
					"Key": "Equals"
				},
				{
					"Source":
					{
						"Text": "Esc"
					},
					"Translation":
					{
						"Text": "Esc"
					},
					"Key": "EscapeShort"
				},
				{
					"Source":
					{
						"Text": "Escape"
					},
					"Translation":
					{
						"Text": "Esc"
					},
					"Key": "Escape"
				},
				{
					"Source":
					{
						"Text": "Exclamation"
					},
					"Translation":
					{
						"Text": "Exclamação"
					},
					"Key": "Exclamation"
				},
				{
					"Source":
					{
						"Text": "F1"
					},
					"Translation":
					{
						"Text": "F1"
					},
					"Key": "F1"
				},
				{
					"Source":
					{
						"Text": "F10"
					},
					"Translation":
					{
						"Text": "F10"
					},
					"Key": "F10"
				},
				{
					"Source":
					{
						"Text": "F11"
					},
					"Translation":
					{
						"Text": "F11"
					},
					"Key": "F11"
				},
				{
					"Source":
					{
						"Text": "F12"
					},
					"Translation":
					{
						"Text": "F12"
					},
					"Key": "F12"
				},
				{
					"Source":
					{
						"Text": "F2"
					},
					"Translation":
					{
						"Text": "F2"
					},
					"Key": "F2"
				},
				{
					"Source":
					{
						"Text": "F3"
					},
					"Translation":
					{
						"Text": "F3"
					},
					"Key": "F3"
				},
				{
					"Source":
					{
						"Text": "F4"
					},
					"Translation":
					{
						"Text": "F4"
					},
					"Key": "F4"
				},
				{
					"Source":
					{
						"Text": "F5"
					},
					"Translation":
					{
						"Text": "F5"
					},
					"Key": "F5"
				},
				{
					"Source":
					{
						"Text": "F6"
					},
					"Translation":
					{
						"Text": "F6"
					},
					"Key": "F6"
				},
				{
					"Source":
					{
						"Text": "F7"
					},
					"Translation":
					{
						"Text": "F7"
					},
					"Key": "F7"
				},
				{
					"Source":
					{
						"Text": "F8"
					},
					"Translation":
					{
						"Text": "F8"
					},
					"Key": "F8"
				},
				{
					"Source":
					{
						"Text": "F9"
					},
					"Translation":
					{
						"Text": "F9"
					},
					"Key": "F9"
				},
				{
					"Source":
					{
						"Text": "Flick"
					},
					"Translation":
					{
						"Text": "Deslizar"
					},
					"Key": "Gesture_Flick"
				},
				{
					"Source":
					{
						"Text": "Fn+Delete"
					},
					"Translation":
					{
						"Text": "Fn+Delete"
					},
					"Key": "ForwardDelete"
				},
				{
					"Source":
					{
						"Text": "Gamepad"
					},
					"Translation":
					{
						"Text": "Controle"
					},
					"Key": "GamepadSubCategory"
				},
				{
					"Source":
					{
						"Text": "Gamepad A"
					},
					"Translation":
					{
						"Text": "Controle A"
					},
					"Key": "XBoxOne_Gamepad_FaceButton_Bottom"
				},
				{
					"Source":
					{
						"Text": "Gamepad B"
					},
					"Translation":
					{
						"Text": "Controle B"
					},
					"Key": "XBoxOne_Gamepad_FaceButton_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad Back"
					},
					"Translation":
					{
						"Text": "Controle — Back"
					},
					"Key": "XBoxOne_Gamepad_Special_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad Circle"
					},
					"Translation":
					{
						"Text": "Controle — Círculo"
					},
					"Key": "PS4_Gamepad_FaceButton_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad D-pad Down"
					},
					"Translation":
					{
						"Text": "Controle — Direcional para Baixo"
					},
					"Key": "Gamepad_DPad_Down"
				},
				{
					"Source":
					{
						"Text": "Gamepad D-pad Left"
					},
					"Translation":
					{
						"Text": "Controle — Direcional para a Esquerda"
					},
					"Key": "Gamepad_DPad_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad D-pad Right"
					},
					"Translation":
					{
						"Text": "Controle — Direcional para a Direita"
					},
					"Key": "Gamepad_DPad_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad D-pad Up"
					},
					"Translation":
					{
						"Text": "Controle — Direcional para Cima"
					},
					"Key": "Gamepad_DPad_Up"
				},
				{
					"Source":
					{
						"Text": "Gamepad Face Button Bottom"
					},
					"Translation":
					{
						"Text": "Controle — Botão frontal de baixo"
					},
					"Key": "Gamepad_FaceButton_Bottom"
				},
				{
					"Source":
					{
						"Text": "Gamepad Face Button Left"
					},
					"Translation":
					{
						"Text": "Controle —Botão frontal esquerdo"
					},
					"Key": "Gamepad_FaceButton_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad Face Button Right"
					},
					"Translation":
					{
						"Text": "Controle — Botão frontal direito"
					},
					"Key": "Gamepad_FaceButton_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad Face Button Top"
					},
					"Translation":
					{
						"Text": "Controle — Botão frontal de cima"
					},
					"Key": "Gamepad_FaceButton_Top"
				},
				{
					"Source":
					{
						"Text": "Gamepad L1"
					},
					"Translation":
					{
						"Text": "Controle — L1"
					},
					"Key": "PS4_Gamepad_LeftShoulder"
				},
				{
					"Source":
					{
						"Text": "Gamepad L2"
					},
					"Translation":
					{
						"Text": "Controle — L2"
					},
					"Key": "PS4_Gamepad_LeftTrigger"
				},
				{
					"Source":
					{
						"Text": "Gamepad L2 Axis"
					},
					"Translation":
					{
						"Text": "Controle — Eixo L2"
					},
					"Key": "PS4_Gamepad_LeftTriggerAxis"
				},
				{
					"Source":
					{
						"Text": "Gamepad L3"
					},
					"Translation":
					{
						"Text": "Controle — L3"
					},
					"Key": "PS4_Gamepad_LeftThumbstick"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Shoulder"
					},
					"Translation":
					{
						"Text": "Controle — Botão superior esquerdo"
					},
					"Key": "Gamepad_LeftShoulder"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Thumbstick 2D-Axis"
					},
					"Translation":
					{
						"Text": "Controle — Direcional Analógico Esquerdo no Eixo 2D"
					},
					"Key": "Gamepad_Left2D"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Thumbstick Button"
					},
					"Translation":
					{
						"Text": "Controle — Botão do Direcional Analógico Esquerdo"
					},
					"Key": "Gamepad_LeftThumbstick"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Thumbstick Down"
					},
					"Translation":
					{
						"Text": "Controle — Direcional Analógico Esquerdo para Baixo"
					},
					"Key": "Gamepad_LeftStick_Down"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Thumbstick Left"
					},
					"Translation":
					{
						"Text": "Controle — Direcional Analógico Esquerdo para a Esquerda"
					},
					"Key": "Gamepad_LeftStick_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Thumbstick Right"
					},
					"Translation":
					{
						"Text": "Controle — Direcional Analógico Esquerdo para a Direita"
					},
					"Key": "Gamepad_LeftStick_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Thumbstick Up"
					},
					"Translation":
					{
						"Text": "Controle — Direcional Analógico Esquerdo para Cima"
					},
					"Key": "Gamepad_LeftStick_Up"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Thumbstick X-Axis"
					},
					"Translation":
					{
						"Text": "Controle — Direcional Analógico Esquerdo no Eixo X"
					},
					"Key": "Gamepad_LeftX"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Thumbstick Y-Axis"
					},
					"Translation":
					{
						"Text": "Controle — Direcional Analógico Esquerdo no Eixo Y"
					},
					"Key": "Gamepad_LeftY"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Trigger"
					},
					"Translation":
					{
						"Text": "Controle — Gatilho esquerdo"
					},
					"Key": "Gamepad_LeftTrigger"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Trigger Axis"
					},
					"Translation":
					{
						"Text": "Controle — Eixo do gatilho esquerdo"
					},
					"Key": "Gamepad_LeftTriggerAxis"
				},
				{
					"Source":
					{
						"Text": "Gamepad Options"
					},
					"Translation":
					{
						"Text": "Controle — Opções"
					},
					"Key": "PS4_Gamepad_Special_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad R1"
					},
					"Translation":
					{
						"Text": "Controle — R1"
					},
					"Key": "PS4_Gamepad_RightShoulder"
				},
				{
					"Source":
					{
						"Text": "Gamepad R2"
					},
					"Translation":
					{
						"Text": "Controle — R2"
					},
					"Key": "PS4_Gamepad_RightTrigger"
				},
				{
					"Source":
					{
						"Text": "Gamepad R2 Axis"
					},
					"Translation":
					{
						"Text": "Controle — Eixo R2"
					},
					"Key": "PS4_Gamepad_RightTriggerAxis"
				},
				{
					"Source":
					{
						"Text": "Gamepad R3"
					},
					"Translation":
					{
						"Text": "Controle — R3"
					},
					"Key": "PS4_Gamepad_RightThumbstick"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Shoulder"
					},
					"Translation":
					{
						"Text": "Controle — Botão superior direito"
					},
					"Key": "Gamepad_RightShoulder"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Thumbstick 2D-Axis"
					},
					"Translation":
					{
						"Text": "Controle — Direcional Analógico Direito no Eixo 2D"
					},
					"Key": "Gamepad_Right2D"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Thumbstick Button"
					},
					"Translation":
					{
						"Text": "Controle — Botão do Direcional Analógico Direito"
					},
					"Key": "Gamepad_RightThumbstick"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Thumbstick Down"
					},
					"Translation":
					{
						"Text": "Controle — Direcional Analógico Direito para Baixo"
					},
					"Key": "Gamepad_RightStick_Down"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Thumbstick Left"
					},
					"Translation":
					{
						"Text": "Controle — Direcional Analógico Direito para a Esquerda"
					},
					"Key": "Gamepad_RightStick_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Thumbstick Right"
					},
					"Translation":
					{
						"Text": "Controle — Direcional Analógico Direito para a Direita"
					},
					"Key": "Gamepad_RightStick_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Thumbstick Up"
					},
					"Translation":
					{
						"Text": "Controle — Direcional Analógico Direito para Cima"
					},
					"Key": "Gamepad_RightStick_Up"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Thumbstick X-Axis"
					},
					"Translation":
					{
						"Text": "Controle — Direcional Analógico Direito no Eixo X"
					},
					"Key": "Gamepad_RightX"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Thumbstick Y-Axis"
					},
					"Translation":
					{
						"Text": "Controle — Direcional Analógico Direito no Eixo Y"
					},
					"Key": "Gamepad_RightY"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Trigger"
					},
					"Translation":
					{
						"Text": "Controle — Gatilho direito"
					},
					"Key": "Gamepad_RightTrigger"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Trigger Axis"
					},
					"Translation":
					{
						"Text": "Controle — Eixo do gatilho direito"
					},
					"Key": "Gamepad_RightTriggerAxis"
				},
				{
					"Source":
					{
						"Text": "Gamepad Special Left"
					},
					"Translation":
					{
						"Text": "Controle — Botão especial esquerdo"
					},
					"Key": "Gamepad_Special_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad Special Right"
					},
					"Translation":
					{
						"Text": "Controle — Botão especial direito"
					},
					"Key": "Gamepad_Special_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad Square"
					},
					"Translation":
					{
						"Text": "Controle — Quadrado"
					},
					"Key": "PS4_Gamepad_FaceButton_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad Start"
					},
					"Translation":
					{
						"Text": "Controle — Start"
					},
					"Key": "XBoxOne_Gamepad_Special_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad Touchpad Button"
					},
					"Translation":
					{
						"Text": "Controle — Botão do Touch Pad"
					},
					"Key": "PS4_Gamepad_Special_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad Triangle"
					},
					"Translation":
					{
						"Text": "Controle — Triângulo"
					},
					"Key": "PS4_Gamepad_FaceButton_Top"
				},
				{
					"Source":
					{
						"Text": "Gamepad X"
					},
					"Translation":
					{
						"Text": "Controle X"
					},
					"Key": "XBoxOne_Gamepad_FaceButton_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad X"
					},
					"Translation":
					{
						"Text": "Controle X"
					},
					"Key": "PS4_Gamepad_FaceButton_Bottom"
				},
				{
					"Source":
					{
						"Text": "Gamepad Y"
					},
					"Translation":
					{
						"Text": "Controle Y"
					},
					"Key": "XBoxOne_Gamepad_FaceButton_Top"
				},
				{
					"Source":
					{
						"Text": "Gesture"
					},
					"Translation":
					{
						"Text": "Gesto"
					},
					"Key": "GestureSubCateogry"
				},
				{
					"Source":
					{
						"Text": "Global Back"
					},
					"Translation":
					{
						"Text": "Global — Voltar"
					},
					"Key": "Global_Back"
				},
				{
					"Source":
					{
						"Text": "Global Menu"
					},
					"Translation":
					{
						"Text": "Global — Menu"
					},
					"Key": "Global_Menu"
				},
				{
					"Source":
					{
						"Text": "Global Pause"
					},
					"Translation":
					{
						"Text": "Global — Pausar"
					},
					"Key": "Global_Pause"
				},
				{
					"Source":
					{
						"Text": "Global Play"
					},
					"Translation":
					{
						"Text": "Global — Executar"
					},
					"Key": "Global_Play"
				},
				{
					"Source":
					{
						"Text": "Global View"
					},
					"Translation":
					{
						"Text": "Global — Visualizar"
					},
					"Key": "Global_View"
				},
				{
					"Source":
					{
						"Text": "Gravity"
					},
					"Translation":
					{
						"Text": "Gravidade"
					},
					"Key": "Gravity"
				},
				{
					"Source":
					{
						"Text": "HTC Vive"
					},
					"Translation":
					{
						"Text": "HTC Vive"
					},
					"Key": "ViveSubCategory"
				},
				{
					"Source":
					{
						"Text": "Home"
					},
					"Translation":
					{
						"Text": "Home"
					},
					"Key": "Home"
				},
				{
					"Source":
					{
						"Text": "Hyphen"
					},
					"Translation":
					{
						"Text": "Hífen"
					},
					"Key": "Hyphen"
				},
				{
					"Source":
					{
						"Text": "Ins"
					},
					"Translation":
					{
						"Text": "Insert"
					},
					"Key": "InsertShort"
				},
				{
					"Source":
					{
						"Text": "Insert"
					},
					"Translation":
					{
						"Text": "Insert"
					},
					"Key": "Insert"
				},
				{
					"Source":
					{
						"Text": "Keyboard"
					},
					"Translation":
					{
						"Text": "Teclado"
					},
					"Key": "KeyboardSubCategory"
				},
				{
					"Source":
					{
						"Text": "LMB"
					},
					"Translation":
					{
						"Text": "LMB"
					},
					"Key": "LeftMouseButtonShort"
				},
				{
					"Source":
					{
						"Text": "Left"
					},
					"Translation":
					{
						"Text": "Para Esquerda"
					},
					"Key": "Left"
				},
				{
					"Source":
					{
						"Text": "Left Alt"
					},
					"Translation":
					{
						"Text": "Alt Esquerdo"
					},
					"Key": "LeftAlt"
				},
				{
					"Source":
					{
						"Text": "Left Bracket"
					},
					"Translation":
					{
						"Text": "Colchete Esquerdo"
					},
					"Key": "LeftBracket"
				},
				{
					"Source":
					{
						"Text": "Left Cmd"
					},
					"Translation":
					{
						"Text": "Cmd Esquerdo"
					},
					"Key": "LeftCommand"
				},
				{
					"Source":
					{
						"Text": "Left Ctrl"
					},
					"Translation":
					{
						"Text": "Ctrl Esquerdo"
					},
					"Key": "LeftControl"
				},
				{
					"Source":
					{
						"Text": "Left Mouse Button"
					},
					"Translation":
					{
						"Text": "Botão esquerdo do mouse"
					},
					"Key": "LeftMouseButton"
				},
				{
					"Source":
					{
						"Text": "Left Parantheses"
					},
					"Translation":
					{
						"Text": "Parêntese Esquerdo"
					},
					"Key": "LeftParantheses"
				},
				{
					"Source":
					{
						"Text": "Left Shift"
					},
					"Translation":
					{
						"Text": "Shift Esquerdo"
					},
					"Key": "LeftShift"
				},
				{
					"Source":
					{
						"Text": "Middle Mouse Button"
					},
					"Translation":
					{
						"Text": "Botão do Meio do Mouse"
					},
					"Key": "MiddleMouseButton"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Grip"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Controle"
					},
					"Key": "MixedReality_Left_Grip_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Menu"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Menu"
					},
					"Key": "MixedReality_Left_Menu_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Thumbstick 2D-Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Eixo 2D do analógico"
					},
					"Key": "MixedReality_Left_Thumbstick_2D"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Thumbstick Button"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Analógico"
					},
					"Key": "MixedReality_Left_Thumbstick_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Thumbstick Down"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Analógico para Baixo"
					},
					"Key": "MixedReality_Left_Thumbstick_Down"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Thumbstick Left"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Analógico para a Esquerda"
					},
					"Key": "MixedReality_Left_Thumbstick_Left"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Thumbstick Right"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Analógico para a Direita"
					},
					"Key": "MixedReality_Left_Thumbstick_Right"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Thumbstick Up"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Analógico para Cima"
					},
					"Key": "MixedReality_Left_Thumbstick_Up"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Thumbstick X-Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Analógico (X)"
					},
					"Key": "MixedReality_Left_Thumbstick_X"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Thumbstick Y-Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Analógico (Y)"
					},
					"Key": "MixedReality_Left_Thumbstick_Y"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad 2D-Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Eixo 2D do trackpad"
					},
					"Key": "MixedReality_Left_Trackpad_2D"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad Button"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Trackpad"
					},
					"Key": "MixedReality_Left_Trackpad_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad Down"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Trackpad para Baixo"
					},
					"Key": "MixedReality_Left_Trackpad_Down"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad Left"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Trackpad para a Esquerda"
					},
					"Key": "MixedReality_Left_Trackpad_Left"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad Right"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Trackpad para a Direita"
					},
					"Key": "MixedReality_Left_Trackpad_Right"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad Touch"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Trackpad (Toque)"
					},
					"Key": "MixedReality_Left_Trackpad_Touch"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad Up"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Trackpad para Cima"
					},
					"Key": "MixedReality_Left_Trackpad_Up"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad X"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Trackpad (X)"
					},
					"Key": "MixedReality_Left_Trackpad_X"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad Y"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Trackpad (Y)"
					},
					"Key": "MixedReality_Left_Trackpad_Y"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trigger"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Gatilho"
					},
					"Key": "MixedReality_Left_Trigger_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trigger Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (E) Eixo do Gatilho"
					},
					"Key": "MixedReality_Left_Trigger_Axis"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Grip"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Controle"
					},
					"Key": "MixedReality_Right_Grip_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Menu"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Menu"
					},
					"Key": "MixedReality_Right_Menu_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Thumbstick 2D-Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Eixo 2D do analógico"
					},
					"Key": "MixedReality_Right_Thumbstick_2D"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Thumbstick Button"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Analógico"
					},
					"Key": "MixedReality_Right_Thumbstick_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Thumbstick Down"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Analógico para Baixo"
					},
					"Key": "MixedReality_Right_Thumbstick_Down"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Thumbstick Left"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Analógico para a Esquerda"
					},
					"Key": "MixedReality_Right_Thumbstick_Left"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Thumbstick Right"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Analógico para a Direita"
					},
					"Key": "MixedReality_Right_Thumbstick_Right"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Thumbstick Up"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Analógico para Cima"
					},
					"Key": "MixedReality_Right_Thumbstick_Up"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Thumbstick X-Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Analógico (X)"
					},
					"Key": "MixedReality_Right_Thumbstick_X"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Thumbstick Y-Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Analógico (Y)"
					},
					"Key": "MixedReality_Right_Thumbstick_Y"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad 2D-Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Eixo 2D do trackpad"
					},
					"Key": "MixedReality_Right_Trackpad_2D"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad Button"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Trackpad"
					},
					"Key": "MixedReality_Right_Trackpad_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad Down"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Trackpad para Baixo"
					},
					"Key": "MixedReality_Right_Trackpad_Down"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad Left"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Trackpad para a Esquerda"
					},
					"Key": "MixedReality_Right_Trackpad_Left"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad Right"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Trackpad para a Direita"
					},
					"Key": "MixedReality_Right_Trackpad_Right"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad Touch"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Trackpad (Toque)"
					},
					"Key": "MixedReality_Right_Trackpad_Touch"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad Up"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Trackpad para Cima"
					},
					"Key": "MixedReality_Right_Trackpad_Up"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad X"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Trackpad (X)"
					},
					"Key": "MixedReality_Right_Trackpad_X"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad Y"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Trackpad (Y)"
					},
					"Key": "MixedReality_Right_Trackpad_Y"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trigger"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Gatilho"
					},
					"Key": "MixedReality_Right_Trigger_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trigger Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (D) Eixo do Gatilho"
					},
					"Key": "MixedReality_Right_Trigger_Axis"
				},
				{
					"Source":
					{
						"Text": "Motion"
					},
					"Translation":
					{
						"Text": "Movimento"
					},
					"Key": "MotionSubCateogry"
				},
				{
					"Source":
					{
						"Text": "Mouse"
					},
					"Translation":
					{
						"Text": "Mouse"
					},
					"Key": "MouseSubCategory"
				},
				{
					"Source":
					{
						"Text": "Mouse Wheel Axis"
					},
					"Translation":
					{
						"Text": "Eixo do Scroll do Mouse"
					},
					"Key": "MouseWheelAxis"
				},
				{
					"Source":
					{
						"Text": "Mouse Wheel Down"
					},
					"Translation":
					{
						"Text": "Scroll do Mouse para Baixo"
					},
					"Key": "MouseScrollDown"
				},
				{
					"Source":
					{
						"Text": "Mouse Wheel Up"
					},
					"Translation":
					{
						"Text": "Scroll do Mouse para Cima"
					},
					"Key": "MouseScrollUp"
				},
				{
					"Source":
					{
						"Text": "Mouse X"
					},
					"Translation":
					{
						"Text": "Mouse X"
					},
					"Key": "MouseX"
				},
				{
					"Source":
					{
						"Text": "Mouse XY 2D-Axis"
					},
					"Translation":
					{
						"Text": "Mouse XY — Eixo 2D"
					},
					"Key": "Mouse2D"
				},
				{
					"Source":
					{
						"Text": "Mouse Y"
					},
					"Translation":
					{
						"Text": "Mouse Y"
					},
					"Key": "MouseY"
				},
				{
					"Source":
					{
						"Text": "Num *"
					},
					"Translation":
					{
						"Text": "Num *"
					},
					"Key": "Multiply"
				},
				{
					"Source":
					{
						"Text": "Num +"
					},
					"Translation":
					{
						"Text": "Num +"
					},
					"Key": "Add"
				},
				{
					"Source":
					{
						"Text": "Num -"
					},
					"Translation":
					{
						"Text": "Num -"
					},
					"Key": "Subtract"
				},
				{
					"Source":
					{
						"Text": "Num ."
					},
					"Translation":
					{
						"Text": "Num ."
					},
					"Key": "Decimal"
				},
				{
					"Source":
					{
						"Text": "Num /"
					},
					"Translation":
					{
						"Text": "Num/"
					},
					"Key": "Divide"
				},
				{
					"Source":
					{
						"Text": "Num 0"
					},
					"Translation":
					{
						"Text": "Num 0"
					},
					"Key": "NumPadZero"
				},
				{
					"Source":
					{
						"Text": "Num 1"
					},
					"Translation":
					{
						"Text": "Num 1"
					},
					"Key": "NumPadOne"
				},
				{
					"Source":
					{
						"Text": "Num 2"
					},
					"Translation":
					{
						"Text": "Num 2"
					},
					"Key": "NumPadTwo"
				},
				{
					"Source":
					{
						"Text": "Num 3"
					},
					"Translation":
					{
						"Text": "Num 3"
					},
					"Key": "NumPadThree"
				},
				{
					"Source":
					{
						"Text": "Num 4"
					},
					"Translation":
					{
						"Text": "Num 4"
					},
					"Key": "NumPadFour"
				},
				{
					"Source":
					{
						"Text": "Num 5"
					},
					"Translation":
					{
						"Text": "Num 5"
					},
					"Key": "NumPadFive"
				},
				{
					"Source":
					{
						"Text": "Num 6"
					},
					"Translation":
					{
						"Text": "Num 6"
					},
					"Key": "NumPadSix"
				},
				{
					"Source":
					{
						"Text": "Num 7"
					},
					"Translation":
					{
						"Text": "Num 7"
					},
					"Key": "NumPadSeven"
				},
				{
					"Source":
					{
						"Text": "Num 8"
					},
					"Translation":
					{
						"Text": "Num 8"
					},
					"Key": "NumPadEight"
				},
				{
					"Source":
					{
						"Text": "Num 9"
					},
					"Translation":
					{
						"Text": "Num 9"
					},
					"Key": "NumPadNine"
				},
				{
					"Source":
					{
						"Text": "Num Lock"
					},
					"Translation":
					{
						"Text": "Num Lock"
					},
					"Key": "NumLock"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch"
					},
					"Key": "OculusTouchSubCategory"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Grip"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Controle"
					},
					"Key": "OculusTouch_Left_Grip_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Grip Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Eixo do Controle"
					},
					"Key": "OculusTouch_Left_Grip_Axis"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Menu"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Menu"
					},
					"Key": "OculusTouch_Left_Menu_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick 2D-Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Eixo 2D do analógico"
					},
					"Key": "OculusTouch_Left_Thumbstick_2D"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick Button"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Analógico"
					},
					"Key": "OculusTouch_Left_Thumbstick_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick Down"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Analógico para Baixo"
					},
					"Key": "OculusTouch_Left_Thumbstick_Down"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick Left"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Analógico para a Esquerda"
					},
					"Key": "OculusTouch_Left_Thumbstick_Left"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick Right"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Analógico para a Direita"
					},
					"Key": "OculusTouch_Left_Thumbstick_Right"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Analógico (Toque)"
					},
					"Key": "OculusTouch_Left_Thumbstick_Touch"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick Up"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Analógico para Cima"
					},
					"Key": "OculusTouch_Left_Thumbstick_Up"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick X-Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Analógico (X)"
					},
					"Key": "OculusTouch_Left_Thumbstick_X"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick Y-Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Analógico (Y)"
					},
					"Key": "OculusTouch_Left_Thumbstick_Y"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Trigger"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Gatilho"
					},
					"Key": "OculusTouch_Left_Trigger_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Trigger Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Eixo do Gatilho"
					},
					"Key": "OculusTouch_Left_Trigger_Axis"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Trigger Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Gatilho (Toque)"
					},
					"Key": "OculusTouch_Left_Trigger_Touch"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) X Press"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Botão X"
					},
					"Key": "OculusTouch_Left_X_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) X Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Toque X"
					},
					"Key": "OculusTouch_Left_X_Touch"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Y Press"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Botão Y"
					},
					"Key": "OculusTouch_Left_Y_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Y Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch (E) Toque Y"
					},
					"Key": "OculusTouch_Left_Y_Touch"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) A Press"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Botão A"
					},
					"Key": "OculusTouch_Right_A_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) A Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Toque A"
					},
					"Key": "OculusTouch_Right_A_Touch"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) B Press"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Botão B"
					},
					"Key": "OculusTouch_Right_B_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) B Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Toque B"
					},
					"Key": "OculusTouch_Right_B_Touch"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Grip"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Controle"
					},
					"Key": "OculusTouch_Right_Grip_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Grip Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Eixo do Controle"
					},
					"Key": "OculusTouch_Right_Grip_Axis"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) System"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Sistema"
					},
					"Key": "OculusTouch_Right_System_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick 2D-Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Eixo 2D do analógico"
					},
					"Key": "OculusTouch_Right_Thumbstick_2D"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick Button"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Analógico"
					},
					"Key": "OculusTouch_Right_Thumbstick_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick Down"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Analógico para Baixo"
					},
					"Key": "OculusTouch_Right_Thumbstick_Down"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick Left"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Analógico para a Esquerda"
					},
					"Key": "OculusTouch_Right_Thumbstick_Left"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick Right"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Analógico para a Direita"
					},
					"Key": "OculusTouch_Right_Thumbstick_Right"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Analógico (Toque)"
					},
					"Key": "OculusTouch_Right_Thumbstick_Touch"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick Up"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Analógico para Cima"
					},
					"Key": "OculusTouch_Right_Thumbstick_Up"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick X-Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Analógico (X)"
					},
					"Key": "OculusTouch_Right_Thumbstick_X"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick Y-Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Analógico (Y)"
					},
					"Key": "OculusTouch_Right_Thumbstick_Y"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Trigger"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Gatilho"
					},
					"Key": "OculusTouch_Right_Trigger_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Trigger Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Eixo do Gatilho"
					},
					"Key": "OculusTouch_Right_Trigger_Axis"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Trigger Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch (D) Gatilho (Toque)"
					},
					"Key": "OculusTouch_Right_Trigger_Touch"
				},
				{
					"Source":
					{
						"Text": "PS4_Special_DEPRECATED"
					},
					"Translation":
					{
						"Text": "PS4_Special"
					},
					"Key": "PS4_Special"
				},
				{
					"Source":
					{
						"Text": "Page Down"
					},
					"Translation":
					{
						"Text": "Page Down"
					},
					"Key": "PageDown"
				},
				{
					"Source":
					{
						"Text": "Page Up"
					},
					"Translation":
					{
						"Text": "Page Up"
					},
					"Key": "PageUp"
				},
				{
					"Source":
					{
						"Text": "Pause"
					},
					"Translation":
					{
						"Text": "Pause"
					},
					"Key": "Pause"
				},
				{
					"Source":
					{
						"Text": "Period"
					},
					"Translation":
					{
						"Text": "Ponto"
					},
					"Key": "Period"
				},
				{
					"Source":
					{
						"Text": "PgDn"
					},
					"Translation":
					{
						"Text": "Page Down"
					},
					"Key": "PageDownShort"
				},
				{
					"Source":
					{
						"Text": "PgUp"
					},
					"Translation":
					{
						"Text": "Page Up"
					},
					"Key": "PageUpShort"
				},
				{
					"Source":
					{
						"Text": "Pinch"
					},
					"Translation":
					{
						"Text": "Juntar os Dedos"
					},
					"Key": "Gesture_Pinch"
				},
				{
					"Source":
					{
						"Text": "Quote"
					},
					"Translation":
					{
						"Text": "Aspas"
					},
					"Key": "Quote"
				},
				{
					"Source":
					{
						"Text": "RMB"
					},
					"Translation":
					{
						"Text": "RMB"
					},
					"Key": "RightMouseButtonShort"
				},
				{
					"Source":
					{
						"Text": "Right"
					},
					"Translation":
					{
						"Text": "Para Direita"
					},
					"Key": "Right"
				},
				{
					"Source":
					{
						"Text": "Right Alt"
					},
					"Translation":
					{
						"Text": "Alt Direito"
					},
					"Key": "RightAlt"
				},
				{
					"Source":
					{
						"Text": "Right Bracket"
					},
					"Translation":
					{
						"Text": "Colchete Direito"
					},
					"Key": "RightBracket"
				},
				{
					"Source":
					{
						"Text": "Right Cmd"
					},
					"Translation":
					{
						"Text": "Cmd Direito"
					},
					"Key": "RightCommand"
				},
				{
					"Source":
					{
						"Text": "Right Ctrl"
					},
					"Translation":
					{
						"Text": "Ctrl Direito"
					},
					"Key": "RightControl"
				},
				{
					"Source":
					{
						"Text": "Right Mouse Button"
					},
					"Translation":
					{
						"Text": "Botão Direito do Mouse"
					},
					"Key": "RightMouseButton"
				},
				{
					"Source":
					{
						"Text": "Right Parantheses"
					},
					"Translation":
					{
						"Text": "Parêntese Direito"
					},
					"Key": "RightParantheses"
				},
				{
					"Source":
					{
						"Text": "Right Shift"
					},
					"Translation":
					{
						"Text": "Shift Direito"
					},
					"Key": "RightShift"
				},
				{
					"Source":
					{
						"Text": "Rotate"
					},
					"Translation":
					{
						"Text": "Girar"
					},
					"Key": "Gesture_Rotate"
				},
				{
					"Source":
					{
						"Text": "Rotation Rate"
					},
					"Translation":
					{
						"Text": "Taxa de Rotação"
					},
					"Key": "RotationRate"
				},
				{
					"Source":
					{
						"Text": "Scroll Lock"
					},
					"Translation":
					{
						"Text": "Scroll Lock"
					},
					"Key": "ScrollLock"
				},
				{
					"Source":
					{
						"Text": "Semicolon"
					},
					"Translation":
					{
						"Text": "Ponto e Vírgula"
					},
					"Key": "Semicolon"
				},
				{
					"Source":
					{
						"Text": "Slash"
					},
					"Translation":
					{
						"Text": "Barra"
					},
					"Key": "Slash"
				},
				{
					"Source":
					{
						"Text": "Space"
					},
					"Translation":
					{
						"Text": "Espaço"
					},
					"Key": "SpaceBarShort"
				},
				{
					"Source":
					{
						"Text": "Space Bar"
					},
					"Translation":
					{
						"Text": "Espaço"
					},
					"Key": "SpaceBar"
				},
				{
					"Source":
					{
						"Text": "SpecialGamepad"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "SpecialGamepadSubCategory"
				},
				{
					"Source":
					{
						"Text": "Steam"
					},
					"Translation":
					{
						"Text": "Steam"
					},
					"Key": "SteamSubCateogry"
				},
				{
					"Source":
					{
						"Text": "Steam Back Left"
					},
					"Translation":
					{
						"Text": "Steam — Botão Traseiro Esquerdo"
					},
					"Key": "Steam_Back_Left"
				},
				{
					"Source":
					{
						"Text": "Steam Back Right"
					},
					"Translation":
					{
						"Text": "Steam — Botão Traseiro Direito"
					},
					"Key": "Steam_Back_Right"
				},
				{
					"Source":
					{
						"Text": "Steam Touch 0"
					},
					"Translation":
					{
						"Text": "Steam — Toque 0"
					},
					"Key": "Steam_Touch_0"
				},
				{
					"Source":
					{
						"Text": "Steam Touch 1"
					},
					"Translation":
					{
						"Text": "Steam — Toque 1"
					},
					"Key": "Steam_Touch_1"
				},
				{
					"Source":
					{
						"Text": "Steam Touch 2"
					},
					"Translation":
					{
						"Text": "Steam — Toque 2"
					},
					"Key": "Steam_Touch_2"
				},
				{
					"Source":
					{
						"Text": "Steam Touch 3"
					},
					"Translation":
					{
						"Text": "Steam — Toque 3"
					},
					"Key": "Steam_Touch_3"
				},
				{
					"Source":
					{
						"Text": "Tab"
					},
					"Translation":
					{
						"Text": "Tab"
					},
					"Key": "Tab"
				},
				{
					"Source":
					{
						"Text": "Thumb Mouse Button"
					},
					"Translation":
					{
						"Text": "Botão Lateral do Mouse"
					},
					"Key": "ThumbMouseButton"
				},
				{
					"Source":
					{
						"Text": "Thumb Mouse Button 2"
					},
					"Translation":
					{
						"Text": "Botão Lateral do Mouse 2"
					},
					"Key": "ThumbMouseButton2"
				},
				{
					"Source":
					{
						"Text": "Tilt"
					},
					"Translation":
					{
						"Text": "Tilt"
					},
					"Key": "Tilt"
				},
				{
					"Source":
					{
						"Text": "Touch"
					},
					"Translation":
					{
						"Text": "Toque"
					},
					"Key": "TouchSubCateogry"
				},
				{
					"Source":
					{
						"Text": "Touch {0}"
					},
					"Translation":
					{
						"Text": "Tocar {0}"
					},
					"Key": "TouchFormat"
				},
				{
					"Source":
					{
						"Text": "Touchpad Button X Axis"
					},
					"Translation":
					{
						"Text": "Botão do painel tátil para o eixo X"
					},
					"Key": "Gamepad_Special_Left_X"
				},
				{
					"Source":
					{
						"Text": "Touchpad Button Y Axis"
					},
					"Translation":
					{
						"Text": "Botão do painel tátil para o eixo Y"
					},
					"Key": "Gamepad_Special_Left_Y"
				},
				{
					"Source":
					{
						"Text": "Underscore"
					},
					"Translation":
					{
						"Text": "Underline"
					},
					"Key": "Underscore"
				},
				{
					"Source":
					{
						"Text": "Up"
					},
					"Translation":
					{
						"Text": "Para Cima"
					},
					"Key": "Up"
				},
				{
					"Source":
					{
						"Text": "Valve Index"
					},
					"Translation":
					{
						"Text": "Valve Index"
					},
					"Key": "ValveIndexSubCategory"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) A Press"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Botão A"
					},
					"Key": "ValveIndex_Left_A_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) A Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Toque A"
					},
					"Key": "ValveIndex_Left_A_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) B Press"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Botão B"
					},
					"Key": "ValveIndex_Left_B_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) B Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Toque B"
					},
					"Key": "ValveIndex_Left_B_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Grip Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Eixo do Controle"
					},
					"Key": "ValveIndex_Left_Grip_Axis"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Grip Force"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Potência do Controle"
					},
					"Key": "ValveIndex_Left_Grip_Force"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) System"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Sistema"
					},
					"Key": "ValveIndex_Left_System_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) System Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Sistema (Toque)"
					},
					"Key": "ValveIndex_Left_System_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick 2D-Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Eixo 2D do analógico"
					},
					"Key": "ValveIndex_Left_Thumbstick_2D"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick Button"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Analógico"
					},
					"Key": "ValveIndex_Left_Thumbstick_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick Down"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Analógico para Baixo"
					},
					"Key": "ValveIndex_Left_Thumbstick_Down"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick Left"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Analógico para a Esquerda"
					},
					"Key": "ValveIndex_Left_Thumbstick_Left"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick Right"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Analógico para a Direita"
					},
					"Key": "ValveIndex_Left_Thumbstick_Right"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Analógico (Toque)"
					},
					"Key": "ValveIndex_Left_Thumbstick_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick Up"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Analógico para Cima"
					},
					"Key": "ValveIndex_Left_Thumbstick_Up"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick X-Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Analógico (X)"
					},
					"Key": "ValveIndex_Left_Thumbstick_X"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick Y-Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Analógico (Y)"
					},
					"Key": "ValveIndex_Left_Thumbstick_Y"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad 2D-Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Eixo 2D do trackpad"
					},
					"Key": "ValveIndex_Left_Trackpad_2D"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad Down"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Trackpad para Baixo"
					},
					"Key": "ValveIndex_Left_Trackpad_Down"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad Force"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Trackpad (Potência)"
					},
					"Key": "ValveIndex_Left_Trackpad_Force"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad Left"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Trackpad para a Esquerda"
					},
					"Key": "ValveIndex_Left_Trackpad_Left"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad Right"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Trackpad para a Direita"
					},
					"Key": "ValveIndex_Left_Trackpad_Right"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Trackpad (Toque)"
					},
					"Key": "ValveIndex_Left_Trackpad_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad Up"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Trackpad para Cima"
					},
					"Key": "ValveIndex_Left_Trackpad_Up"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad X"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Trackpad (X)"
					},
					"Key": "ValveIndex_Left_Trackpad_X"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad Y"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Trackpad (Y)"
					},
					"Key": "ValveIndex_Left_Trackpad_Y"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trigger"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Gatilho"
					},
					"Key": "ValveIndex_Left_Trigger_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trigger Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Eixo do Gatilho"
					},
					"Key": "ValveIndex_Left_Trigger_Axis"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trigger Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (E) Gatilho (Toque)"
					},
					"Key": "ValveIndex_Left_Trigger_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) A Press"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Botão A"
					},
					"Key": "ValveIndex_Right_A_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) A Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Toque A"
					},
					"Key": "ValveIndex_Right_A_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) B Press"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Botão B"
					},
					"Key": "ValveIndex_Right_B_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) B Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Toque B"
					},
					"Key": "ValveIndex_Right_B_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Grip Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Eixo do Controle"
					},
					"Key": "ValveIndex_Right_Grip_Axis"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Grip Force"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Potência do Controle"
					},
					"Key": "ValveIndex_Right_Grip_Force"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) System"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Sistema"
					},
					"Key": "ValveIndex_Right_System_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) System Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Sistema (Toque)"
					},
					"Key": "ValveIndex_Right_System_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick 2D-Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Eixo 2D do analógico"
					},
					"Key": "ValveIndex_Right_Thumbstick_2D"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick Button"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Analógico"
					},
					"Key": "ValveIndex_Right_Thumbstick_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick Down"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Analógico para Baixo"
					},
					"Key": "ValveIndex_Right_Thumbstick_Down"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick Left"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Analógico para a Esquerda"
					},
					"Key": "ValveIndex_Right_Thumbstick_Left"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick Right"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Analógico para a Direita"
					},
					"Key": "ValveIndex_Right_Thumbstick_Right"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Analógico (Toque)"
					},
					"Key": "ValveIndex_Right_Thumbstick_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick Up"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Analógico para Cima"
					},
					"Key": "ValveIndex_Right_Thumbstick_Up"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick X-Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Analógico (X)"
					},
					"Key": "ValveIndex_Right_Thumbstick_X"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick Y-Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Analógico (Y)"
					},
					"Key": "ValveIndex_Right_Thumbstick_Y"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad 2D-Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Eixo 2D do trackpad"
					},
					"Key": "ValveIndex_Right_Trackpad_2D"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad Down"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Trackpad para Baixo"
					},
					"Key": "ValveIndex_Right_Trackpad_Down"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad Force"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Trackpad (Potência)"
					},
					"Key": "ValveIndex_Right_Trackpad_Force"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad Left"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Trackpad para a Esquerda"
					},
					"Key": "ValveIndex_Right_Trackpad_Left"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad Right"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Trackpad para a Direita"
					},
					"Key": "ValveIndex_Right_Trackpad_Right"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Trackpad (Toque)"
					},
					"Key": "ValveIndex_Right_Trackpad_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad Up"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Trackpad para Cima"
					},
					"Key": "ValveIndex_Right_Trackpad_Up"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad X"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Trackpad (X)"
					},
					"Key": "ValveIndex_Right_Trackpad_X"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad Y"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Trackpad (Y)"
					},
					"Key": "ValveIndex_Right_Trackpad_Y"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trigger"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Gatilho"
					},
					"Key": "ValveIndex_Right_Trigger_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trigger Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Eixo do Gatilho"
					},
					"Key": "ValveIndex_Right_Trigger_Axis"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trigger Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (D) Gatilho (Toque)"
					},
					"Key": "ValveIndex_Right_Trigger_Touch"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Grip"
					},
					"Translation":
					{
						"Text": "Vive (E) Controle"
					},
					"Key": "Vive_Left_Grip_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Menu"
					},
					"Translation":
					{
						"Text": "Vive (E) Menu"
					},
					"Key": "Vive_Left_Menu_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (L) System"
					},
					"Translation":
					{
						"Text": "Vive (E) Sistema"
					},
					"Key": "Vive_Left_System_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad 2D-Axis"
					},
					"Translation":
					{
						"Text": "Vive (E) Eixo 2D do trackpad"
					},
					"Key": "Vive_Left_Trackpad_2D"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad Button"
					},
					"Translation":
					{
						"Text": "Vive (E) Trackpad"
					},
					"Key": "Vive_Left_Trackpad_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad Down"
					},
					"Translation":
					{
						"Text": "Vive (E) Trackpad para Baixo"
					},
					"Key": "Vive_Left_Trackpad_Down"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad Left"
					},
					"Translation":
					{
						"Text": "Vive (E) Trackpad para a Esquerda"
					},
					"Key": "Vive_Left_Trackpad_Left"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad Right"
					},
					"Translation":
					{
						"Text": "Vive (E) Trackpad para a Direita"
					},
					"Key": "Vive_Left_Trackpad_Right"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad Touch"
					},
					"Translation":
					{
						"Text": "Vive (E) Trackpad (Toque)"
					},
					"Key": "Vive_Left_Trackpad_Touch"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad Up"
					},
					"Translation":
					{
						"Text": "Vive (E) Trackpad para Cima"
					},
					"Key": "Vive_Left_Trackpad_Up"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad X-Axis"
					},
					"Translation":
					{
						"Text": "Vive (E) Trackpad (X)"
					},
					"Key": "Vive_Left_Trackpad_X"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad Y-Axis"
					},
					"Translation":
					{
						"Text": "Vive (E) Trackpad (Y)"
					},
					"Key": "Vive_Left_Trackpad_Y"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trigger"
					},
					"Translation":
					{
						"Text": "Vive (E) Gatilho"
					},
					"Key": "Vive_Left_Trigger_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trigger Axis"
					},
					"Translation":
					{
						"Text": "Vive (E) Eixo do Gatilho"
					},
					"Key": "Vive_Left_Trigger_Axis"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Grip"
					},
					"Translation":
					{
						"Text": "Vive (D) Controle"
					},
					"Key": "Vive_Right_Grip_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Menu"
					},
					"Translation":
					{
						"Text": "Vive (D) Menu"
					},
					"Key": "Vive_Right_Menu_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (R) System"
					},
					"Translation":
					{
						"Text": "Vive (D) Sistema"
					},
					"Key": "Vive_Right_System_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad 2D-Axis"
					},
					"Translation":
					{
						"Text": "Vive (D) Eixo 2D do trackpad"
					},
					"Key": "Vive_Right_Trackpad_2D"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad Button"
					},
					"Translation":
					{
						"Text": "Vive (D) Trackpad"
					},
					"Key": "Vive_Right_Trackpad_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad Down"
					},
					"Translation":
					{
						"Text": "Vive (D) Trackpad para Baixo"
					},
					"Key": "Vive_Right_Trackpad_Down"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad Left"
					},
					"Translation":
					{
						"Text": "Vive (D) Trackpad para a Esquerda"
					},
					"Key": "Vive_Right_Trackpad_Left"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad Right"
					},
					"Translation":
					{
						"Text": "Vive (D) Trackpad para a Direita"
					},
					"Key": "Vive_Right_Trackpad_Right"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad Touch"
					},
					"Translation":
					{
						"Text": "Vive (D) Trackpad (Toque)"
					},
					"Key": "Vive_Right_Trackpad_Touch"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad Up"
					},
					"Translation":
					{
						"Text": "Vive (D) Trackpad para Cima"
					},
					"Key": "Vive_Right_Trackpad_Up"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad X-Axis"
					},
					"Translation":
					{
						"Text": "Vive (D) Trackpad (X)"
					},
					"Key": "Vive_Right_Trackpad_X"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad Y-Axis"
					},
					"Translation":
					{
						"Text": "Vive (D) Trackpad (Y)"
					},
					"Key": "Vive_Right_Trackpad_Y"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trigger"
					},
					"Translation":
					{
						"Text": "Vive (D) Gatilho"
					},
					"Key": "Vive_Right_Trigger_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trigger Axis"
					},
					"Translation":
					{
						"Text": "Vive (D) Eixo do Gatilho"
					},
					"Key": "Vive_Right_Trigger_Axis"
				},
				{
					"Source":
					{
						"Text": "Windows Mixed Reality"
					},
					"Translation":
					{
						"Text": "Windows Mixed Reality"
					},
					"Key": "MixedRealitySubCategory"
				},
				{
					"Source":
					{
						"Text": "XBox One"
					},
					"Translation":
					{
						"Text": "Xbox One"
					},
					"Key": "XBoxOneSubCateogry"
				}
			]
		},
		{
			"Namespace": "LinuxDynamicRHI",
			"Children": [
				{
					"Source":
					{
						"Text": "Failed to load OpenGL Driver which is required to run the engine.\nOpenGL4 has been deprecated and should use Vulkan."
					},
					"Translation":
					{
						"Text": "Falha ao carregar Driver OpenGL necessário para executar o engine.\nOpenGL4 foi descontinuado e é preciso usar o Vulkan."
					},
					"Key": "NoOpenGLDriver"
				},
				{
					"Source":
					{
						"Text": "Failed to load Vulkan Driver which is required to run the engine.\nThe engine no longer fallbacks to OpenGL4 which has been deprecated."
					},
					"Translation":
					{
						"Text": "Falha ao carregar Driver Vulkan necessário para executar o engine.\nO engine não reincide mais para o OpenGL4 pois foi descontinuado."
					},
					"Key": "NoVulkanDriver"
				},
				{
					"Source":
					{
						"Text": "OpenGL 4.3 is required to run the engine."
					},
					"Translation":
					{
						"Text": "Requer OpenGL 4.3 para executar a tecnologia."
					},
					"Key": "RequiredOpenGL"
				},
				{
					"Source":
					{
						"Text": "The project does not target Vulkan or OpenGL RHIs, check project settings or pass -nullrhi."
					},
					"Translation":
					{
						"Text": "O projeto não se concentra em RHIs Vulkan ou OpenGL. Verifique as configurações do projeto ou passe -nullrhi."
					},
					"Key": "NoTargetedRHI"
				},
				{
					"Source":
					{
						"Text": "Trying to force OpenGL RHI but the project does not have it in TargetedRHIs list."
					},
					"Translation":
					{
						"Text": "Tentando abrir à força RHI OpenGL, mas o projeto não o tem na lista TargetedRHIs."
					},
					"Key": "NoOpenGLTargetedRHI"
				},
				{
					"Source":
					{
						"Text": "Trying to force Vulkan RHI but the project does not have it in TargetedRHIs list."
					},
					"Translation":
					{
						"Text": "Tentando abrir à força RHI Vulkan, mas o projeto não o tem na lista TargetedRHIs."
					},
					"Key": "NoVulkanTargetedRHI"
				},
				{
					"Source":
					{
						"Text": "Vulkan Driver is required to run the engine."
					},
					"Translation":
					{
						"Text": "Requer driver Vulkan para executar a tecnologia."
					},
					"Key": "RequiredVulkan"
				},
				{
					"Source":
					{
						"Text": "Vulkan or OpenGL (4.3) support is required to run the engine."
					},
					"Translation":
					{
						"Text": "Requer suporte a Vulkan ou OpenGL (4.3) para executar a tecnologia."
					},
					"Key": "NoVulkanNoGL"
				},
				{
					"Source":
					{
						"Text": "Warning: OpenGL is no longer supported for desktop platforms. Vulkan will be used instead."
					},
					"Translation":
					{
						"Text": "Aviso: OpenGL não é mais compatível com plataformas de desktop. Em vez disso, Vulkan será utilizado."
					},
					"Key": "OpenGLRemoved"
				}
			]
		},
		{
			"Namespace": "MessageDialog",
			"Children": [
				{
					"Source":
					{
						"Text": "Please update to the latest version of macOS for best performance and stability."
					},
					"Translation":
					{
						"Text": "Atualize para a versão mais recente do macOS para melhor desempenho e estabilidade."
					},
					"Key": "UpdateMacOSX_Body"
				},
				{
					"Source":
					{
						"Text": "The installed version of the {Vendor} graphics driver has known issues in {RHI}.\nPlease install either the latest or the recommended driver version or switch to a different rendering API.\n\nWould you like to visit the following URL to download the driver?\n\n{Hyperlink}\n\n{AdapterName}\nInstalled: {InstalledVer}\nRecommended: {RecommendedVer}"
					},
					"Translation":
					{
						"Text": "A versão instalada do driver de vídeo {Vendor} tem problemas conhecidos em {RHI}.\nInstale a versão recomendada ou a versão mais atual do driver ou use uma API de Renderização diferente.\n\nQuer visitar a seguinte URL para baixar o driver?\n\n{Hyperlink}\n\n{AdapterName}\nVersão instalada: {InstalledVer}\nRecomendada: {RecommendedVer}"
					},
					"Key": "VideoCardDriverRHIIssueReport"
				},
				{
					"Source":
					{
						"Text": "The installed version of the {Vendor} graphics driver has known issues.\nPlease install either the latest or the recommended driver version.\n\nWould you like to visit the following URL to download the driver?\n\n{Hyperlink}\n\n{AdapterName}\nInstalled: {InstalledVer}\nRecommended: {RecommendedVer}"
					},
					"Translation":
					{
						"Text": "A versão instalada do driver de vídeo {Vendor} tem problemas conhecidos.\nInstale a versão recomendada ou a versão mais atual do driver.\n\nQuer visitar a seguinte URL para baixar o driver?\n\n{Hyperlink}\n\n{AdapterName}\nVersão instalada: {InstalledVer}\nRecomendada: {RecommendedVer}"
					},
					"Key": "VideoCardDriverIssueReport"
				},
				{
					"Source":
					{
						"Text": "The latest version of the {Vendor} graphics driver has known issues in {RHI}.\nPlease install the recommended driver version or switch to a different rendering API.\n\nWould you like to visit the following URL to download the driver?\n\n{Hyperlink}\n\n{AdapterName}\nInstalled: {InstalledVer}\nRecommended: {RecommendedVer}"
					},
					"Translation":
					{
						"Text": "A última versão do driver de vídeo {Vendor} tem problemas conhecidos em {RHI}.\nInstale a versão recomendada do driver ou use uma API de Renderização diferente.\n\nQuer visitar a seguinte URL para baixar o driver?\n\n{Hyperlink}\n\n{AdapterName}\nVersão instalada: {InstalledVer}\nRecomendada: {RecommendedVer}"
					},
					"Key": "LatestVideoCardDriverRHIIssueReport"
				},
				{
					"Source":
					{
						"Text": "The latest version of the {Vendor} graphics driver has known issues.\nPlease install the recommended driver version.\n\nWould you like to visit the following URL to download the driver?\n\n{Hyperlink}\n\n{AdapterName}\nInstalled: {InstalledVer}\nRecommended: {RecommendedVer}"
					},
					"Translation":
					{
						"Text": "A última versão do driver de vídeo {Vendor} tem problemas conhecidos.\nInstale a versão recomendada do driver.\n\nQuer visitar a seguinte URL para baixar o driver?\n\n{Hyperlink}\n\n{AdapterName}\nVersão instalada: {InstalledVer}\nRecomendada: {RecommendedVer}"
					},
					"Key": "LatestVideoCardDriverIssueReport"
				},
				{
					"Source":
					{
						"Text": "Update macOS"
					},
					"Translation":
					{
						"Text": "Atualizar macOS"
					},
					"Key": "UpdateMacOSX_Title"
				},
				{
					"Source":
					{
						"Text": "WARNING: Known issues with graphics driver"
					},
					"Translation":
					{
						"Text": "ALERTA: Problemas conhecidos com o driver de vídeo  "
					},
					"Key": "TitleVideoCardDriverIssue"
				},
				{
					"Source":
					{
						"Text": "https://downloadcenter.intel.com/product/80939/Graphics"
					},
					"Translation":
					{
						"Text": "https://downloadcenter.intel.com/pt-br/product/80939/Graphics"
					},
					"Key": "DriverDownloadLinkIntel"
				},
				{
					"Source":
					{
						"Text": "https://www.amd.com/en/support"
					},
					"Translation":
					{
						"Text": "https://www.amd.com/pt/support"
					},
					"Key": "DriverDownloadLinkAMD"
				},
				{
					"Source":
					{
						"Text": "https://www.nvidia.com/en-us/geforce/drivers/"
					},
					"Translation":
					{
						"Text": "https://www.nvidia.com/pt-br/geforce/drivers/"
					},
					"Key": "DriverDownloadLinkNVIDIA"
				}
			]
		},
		{
			"Namespace": "UnrealBuildConfigurations",
			"Children": [
				{
					"Source":
					{
						"Text": "Debug"
					},
					"Translation":
					{
						"Text": "Depuração"
					},
					"Key": "DebugName"
				},
				{
					"Source":
					{
						"Text": "DebugGame"
					},
					"Translation":
					{
						"Text": "Depurar Jogo"
					},
					"Key": "DebugGameName"
				},
				{
					"Source":
					{
						"Text": "Development"
					},
					"Translation":
					{
						"Text": "Desenvolvimento"
					},
					"Key": "DevelopmentName"
				},
				{
					"Source":
					{
						"Text": "Shipping"
					},
					"Translation":
					{
						"Text": "Envio"
					},
					"Key": "ShippingName"
				},
				{
					"Source":
					{
						"Text": "Test"
					},
					"Translation":
					{
						"Text": "Testar"
					},
					"Key": "TestName"
				},
				{
					"Source":
					{
						"Text": "Unknown"
					},
					"Translation":
					{
						"Text": "Desconhecido"
					},
					"Key": "UnknownName"
				}
			]
		},
		{
			"Namespace": "WindowsDynamicRHI",
			"Children": [
				{
					"Source":
					{
						"Text": "-d3d12/dx12, -d3d11/dx11, -vulkan, and -opengl are mutually exclusive options, but more than one was specified on the command-line."
					},
					"Translation":
					{
						"Text": "-d3d12/dx12, -d3d11/dx11, -vulkan, e -opengl são opções mutuamente exclusivas, mas mais de uma foi especificada na linha de comando."
					},
					"Key": "RHIOptionsError"
				},
				{
					"Source":
					{
						"Text": "A D3D11-compatible GPU (Feature Level 11.0, Shader Model 5.0) is required to run the engine."
					},
					"Translation":
					{
						"Text": "Requer um GPU compatível com D3D11 (Nível de Recurso 11.0, Shader Model 5.0) para executar o engine."
					},
					"Key": "RequiredDX11Feature_11_SM5"
				},
				{
					"Source":
					{
						"Text": "DX12 SM6 is not supported on your system. Try running without the -sm6 command line argument."
					},
					"Translation":
					{
						"Text": "DX12 SM6 não é compatível com o seu sistema. Tente executar sem o argumento -sm6 da linha de comando."
					},
					"Key": "RequiredDX12SM6"
				},
				{
					"Source":
					{
						"Text": "DX12 is not supported on your system. Try running without the -dx12 or -d3d12 command line argument."
					},
					"Translation":
					{
						"Text": "Seu sistema não suporta o DX12. Tente executar sem o argumento -dx12 ou -d3d12 na linha de comando."
					},
					"Key": "RequiredDX12"
				},
				{
					"Source":
					{
						"Text": "DirectX 12 is not supported for Performance Mode."
					},
					"Translation":
					{
						"Text": "DirectX 12 não é suportado no Modo Desempenho."
					},
					"Key": "RHIPerformanceDX12"
				},
				{
					"Source":
					{
						"Text": "OpenGL 4.3 is required to run the engine."
					},
					"Translation":
					{
						"Text": "Requer OpenGL 4.3 para executar a tecnologia."
					},
					"Key": "RequiredOpenGL"
				},
				{
					"Source":
					{
						"Text": "OpenGL is not supported for Performance Mode."
					},
					"Translation":
					{
						"Text": "OpenGL não é suportado no Modo Desempenho."
					},
					"Key": "RHIPerformanceOpenGL"
				},
				{
					"Source":
					{
						"Text": "Unable to launch with RHI '{0}' since the project is not configured to support it."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MissingTargetedShaderFormats"
				},
				{
					"Source":
					{
						"Text": "Vulkan Driver is required to run the engine."
					},
					"Translation":
					{
						"Text": "Requer driver Vulkan para executar a tecnologia."
					},
					"Key": "RequiredVulkan"
				},
				{
					"Source":
					{
						"Text": "Vulkan is not supported for Performance Mode."
					},
					"Translation":
					{
						"Text": "Vulkan não é suportado no Modo Desempenho."
					},
					"Key": "RHIPerformanceVulkan"
				}
			]
		}
	]
}